{
    "comment": ["VARRIABLE NAMES",
    "mechHealth",
    "waterAmount",
    "maxWaterAmount",

    "townDriftBond",
    "townFlameBond",
    "townSaltBond",
  
    "npc1Story"],

  "dialogues": [
    {
      "name": "Week1",
      "id": 1,
      "text": "You were told to find the mobile rig THESEUS, and that this clan of Drifters is one constantly shifting both in location and in customs. Fortunately, for this first meeting, a pre-arranged location was arranged for the apex of the fourth lunar month.",
      "choices": [{ "nextDialogueID": 2 }]
    },
    {
      "name": "Week1",
      "id": 2,
      "text": "Hours ago, you discovered the tracks of their people leading across the dry, grassy plains. Gentle spirals and flurries of dust devils steal dirt and rock from the surface of the earth, lifting them ever higher—out through the atmosphere towards the infinity of space. Like a long sigh from the planet, these rolling hills are marked by thin, quiet cyclones siphoning Elysium grain by grain.",
      "choices": [{ "nextDialogueID": 3 }]
    },
    {
      "name": "Week1",
      "id": 3,
      "text": "Yet it is here, in the haunting despair and slow-drifting beauty of the fields, that you find the swaying black tarps of a caravan. A series of oversized, circular tents dot a distant hillside. As you approach, you bid OSIRIS wave its antenna-staff before you, increasing the range of your sensors. When at last you arrive at the edge of the caravan, you begin to detect a faint ping…",
      "choices": [{ "nextDialogueID": 4 }]
    },
    {
      "name": "Week1",
      "id": 4,
      "text": "Near you, one of the pitched tents groans and slowly folds in on itself as it begins to make itself taller. Between the dust cloud and blackness of the tarp, you spot mechanical joints and retracting poles as the tent staggers to its feet. Completing its metamorphosis with a heavy release of its tarp into a cloak, a mobile rig has appeared before you. THESEUS. ",
      "choices": [{ "nextDialogueID": 5 }]
    },
    {
      "name": "Week1",
      "id": 5,
      "text": "'Welcome to our Veil. We will pay our tribute for 13 mules’ water, if you really came to render such services. 7 mules grants us drinking water, but stifles our nomadicism. The coolant needed to travel long hours in the rigs… well, I’m sure you’re familiar.'",
      "choices": [
	{"text": "You can support their way of life for now. Pay in full (13).", "nextDialogueID": 6, "value": ["townDriftBond", "waterAmount"], "change": [2, -13]},
	{"text": "Their wandering seems aimless, like a luxury. Surely they can stay put for one week. Pay in half (7).", "nextDialogueID": 7, "value": ["townDriftBond", "waterAmount"], "change": [-1, -7]},
      ]
    },
    {
      "name": "Week1",
      "id": 6,
      "text": "'Your trust in strangers, good Shepherd, is a mark in your favor. From your position of power, that you would still try to treat us fairly, though our ways are foreign to you… human virtue has not yet been extinguished from Elysium, it seems. Call me Charon, and may the stars light your path on your travels.' THESEUS shambles away to lead your mules to the rest of the caravan’s improvised tents.",
      "choices": ["nextDialogueID": 8]
    },
    {
      "name": "Week1",
      "id": 7,
      "text": "'... I see. Even the Plant must have limited supplies… all the more reason…' THESEUS’ pilot mutters to themselves before staggering away to lead the mules to the rest of the caravan. It seemed the village elder wasn’t even disappointed, just tired. Well, perhaps next week you will find out more.",
      "choices": [
	{"text": "They seem quick to judgment and suspicion.", "nextDialogueID": 8},
	{"text": "You know many who would react far worse to being at minimum water thresholds for their entire lives.", "nextDialogueID": 8},
      ]
    },
    {
      "name": "Week1",
      "id": 8,
      "text": "As you’re leaving, you notice a cloaked rig waiting by the roadside. PARIS signals through your computer screen, 'Spare me a mule, Shepherd? When I’m safely away, come find me and I will tell you of the ultimate betrayal of my people. But I can stomach this caravan no longer, and I beg your aid in making a life for myself elsewhere.'",
      "choices": [
        {"text": "Ultimate betrayal? A little dramatic, and you’re not sure if you’ll upset the Drifters by helping this runaway Do not help (0).", "nextDialogueID": 9},
        {"text": "You don’t fully understand his desperation, but then, you don’t need to. It’s clear he needs help, and you can offer it. Spare him a mule (1).", "nextDialogueID": 9, "value": ["waterAmount"], "change": [-1]} 
      ]
    },
    {
      "name": "Week1",
      "id": 9,
      "text": "Other Drifters are slowly rising from their stationary configurations, and your meeting abruptly ends with PARIS turning and dashing along the route you took to get here. Before it has fully fled, your sensors register its name change: PROMETHEUS. You wonder if you will meet again.",
      "choices": ["nextDialogueID": -1]
    },
    {
      "name": "Week2",
      "id": 1,
      "text": "Tracking down the Drifters’ Veil was always a challenge in and of itself. Their last message to the Plant gave you a general area to search, but part of you wonders why they have to make it hard on themselves to receive life-sustaining water. As you crest a hill, you stumble upon their black pitched tents huddled in the grassy valley. THESEUS finds you shortly. 'Welcome again to our Veil, Shepherd…' Again, he asks for 13 mules.",
      "choices": [
        {"text": "Pay in full (13).", "nextDialogueID": 4, "value": ["townDriftBond", "waterAmount"], "change": [2, -13]},
        {"text": "Pay less than full (display other options).", "nextDialogueID": 2} 
      ]
    },
    {
      "name": "Week2",
      "id": 2,
      "text": "How much water can you spare? ",
      "choices": [
        {"text": "Only what they need to survive (7).", "nextDialogueID": 3, "value": ["townDriftBond", "waterAmount"], "change": [-1, -7]},
        {"text": "None. The time wasted to track them is time you lag in delivering water to other communities. Let them learn this lesson. (0).", "nextDialogueID": 3, "value": ["townDriftBond"], "change": [-2]} 
      ]
    },
    {
      "name": "Week2",
      "id": 3,
      "text": "For a moment, there is silence. Then, wordlessly, THESEUS turns to leave you, their cloak fluttering behind and obscuring them. What arrogant, strange people. You wonder if they would choose similarly in your shoes, knowing the state of the Plant and Elysium.",
      "choices": ["nextDialogueID": -1]
    },
    {
      "name": "Week2",
      "id": 4,
      "text": "'Water goes to more than just our coolant, Shepherd. In truth, on the backs of our most trusted people, we carry the means to separate the hydrogen from the oxygen in the distilled water you deliver us. Hydrogen, difficult as it is to store, burns cleanly, that we might travel without scarring the land. It’s lightweight, and it has an incredible energy density. When we have found what we are looking for, I hope that we can then share this old technology with the rest of Elysium.'",
      "choices": ["nextDialogueID": -1]
    },
    {
      "name": "Week3",
      "id": 1,
      "text": "You find the Drifters at the foot of the mountains closing in the valley you’ve come to know. THESEUS patches into your screen, but the voice is different. 'Shepherd. 13 mules are not for our travel, but for our rebirth. Time is short, make your choice. Ally of humanity, or shortsighted fool.'",
      "choices": [
        {"text": "What? Sure, pay in full. (13)", "nextDialogueID": 3, "value": ["townDriftBond", "waterAmount"], "change": [2, -13]},
        {"text": "Pay less than full (display other options).", "nextDialogueID": 2} 
      ]
    },
    {
      "name": "Week3",
      "id": 2,
      "text": "These people’s only consistent quality is their ability to avoid a direct explanation.",
      "choices": [
        {"text": "You’re not quite sure what good it will do anymore, but you pay in half. (7)", "nextDialogueID": 4, "value": ["townDriftBond", "waterAmount"], "change": [-1, -7]},
        {"text": "You cannot spare water for their riddles and suspicions. Give nothing. (0)", "nextDialogueID": 4, "value": ["townDriftBond"], "change": [-2]} 
      ]
    },
    {
      "name": "Week3",
      "id": 3,
      "text": "'With this, we can bring electricity back to the facility… people won’t be trapped on Elysium much longer. Humanity can be saved…!' The Drifters abruptly turn and leave, leading your mules up a long and winding mountain trail. It may take them many days to reach the top. You, at least, have done what they asked of you.",
      "choices": [
        {"text": "You hope that their discovery can’t be turned against others.", "nextDialogueID": -1},
        {"text": "You’re sure that you will hear news of their triumph, whatever it is, in the weeks to come.", "nextDialogueID": -1} 
      ]
    },
    {
      "name": "Week3",
      "id": 4,
      "text": "'You… the Plant keeps choking us out, trying to keep themselves in power… can’t you see this is bigger than your paranoia and distrust? Bigger than the other towns you supply with no plan for their own futures? People… Perhaps this is why we were condemned to Elysium…' THESEUS skulks away, mobilizing the Veil. You watch as they begin a slow trek up the mountain, leaving you and your flock in the dust.",
      "choices": [
        {"text": "You wonder if even their own people know what THESEUS is talking about anymore. ", "nextDialogueID": -1},
        {"text": "It truly is a shame.", "nextDialogueID": -1} 
      ]
    }
  ]
}